name: "app_act_resNet-50"
layer {
  name: "data"
  type: "PartActionWithCtxData"
  top: "data"
  top: "label"
  transform_param {
    mirror: true
    crop_size: 224
    mean_value: 128
    mean_value: 128
    mean_value: 128
    jit_scale: 140
    jit_scale: 224
  }
  part_action_with_ctx_data_param {
    source: "your_path/stanford40/train.txt"
    root_folder_bbox: "your_path/stanford40/BBOXImages/"
    root_folder_ctx: "your_path/stanford40/JPEGImages/"
    root_folder_part: "your_path/stanford40/PARTImages/"
    root_folder_anno: "your_path/PartAnnotations/"
    label_bias: 40
    shuffle: true
    batch_size: 1
    new_height: 224
    new_width: 224
  }
}
##############################################
layer {
	bottom: "data"
	top: "app_conv1"
	name: "app_conv1"
	type: "Convolution"
	convolution_param {
		num_output: 64
		kernel_size: 7
		pad: 3
		stride: 2
	}
}

layer {
	bottom: "app_conv1"
	top: "app_conv1"
	name: "app_bn_conv1"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_conv1"
	top: "app_conv1"
	name: "app_scale_conv1"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_conv1"
	top: "app_conv1"
	name: "app_conv1_relu"
	type: "ReLU"
}

layer {
	bottom: "app_conv1"
	top: "app_pool1"
	name: "app_pool1"
	type: "Pooling"
	pooling_param {
		kernel_size: 3
		stride: 2
		pool: MAX
	}
}

layer {
	bottom: "app_pool1"
	top: "app_res2a_branch1"
	name: "app_res2a_branch1"
	type: "Convolution"
	convolution_param {
		num_output: 256
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res2a_branch1"
	top: "app_res2a_branch1"
	name: "app_bn2a_branch1"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res2a_branch1"
	top: "app_res2a_branch1"
	name: "app_scale2a_branch1"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_pool1"
	top: "app_res2a_branch2a"
	name: "app_res2a_branch2a"
	type: "Convolution"
	convolution_param {
		num_output: 64
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res2a_branch2a"
	top: "app_res2a_branch2a"
	name: "app_bn2a_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res2a_branch2a"
	top: "app_res2a_branch2a"
	name: "app_scale2a_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res2a_branch2a"
	top: "app_res2a_branch2a"
	name: "app_res2a_branch2a_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res2a_branch2a"
	top: "app_res2a_branch2b"
	name: "app_res2a_branch2b"
	type: "Convolution"
	convolution_param {
		num_output: 64
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res2a_branch2b"
	top: "app_res2a_branch2b"
	name: "app_bn2a_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res2a_branch2b"
	top: "app_res2a_branch2b"
	name: "app_scale2a_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res2a_branch2b"
	top: "app_res2a_branch2b"
	name: "app_res2a_branch2b_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res2a_branch2b"
	top: "app_res2a_branch2c"
	name: "app_res2a_branch2c"
	type: "Convolution"
	convolution_param {
		num_output: 256
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res2a_branch2c"
	top: "app_res2a_branch2c"
	name: "app_bn2a_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res2a_branch2c"
	top: "app_res2a_branch2c"
	name: "app_scale2a_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res2a_branch1"
	bottom: "app_res2a_branch2c"
	top: "app_res2a"
	name: "app_res2a"
	type: "Eltwise"
}

layer {
	bottom: "app_res2a"
	top: "app_res2a"
	name: "app_res2a_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res2a"
	top: "app_res2b_branch2a"
	name: "app_res2b_branch2a"
	type: "Convolution"
	convolution_param {
		num_output: 64
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res2b_branch2a"
	top: "app_res2b_branch2a"
	name: "app_bn2b_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res2b_branch2a"
	top: "app_res2b_branch2a"
	name: "app_scale2b_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res2b_branch2a"
	top: "app_res2b_branch2a"
	name: "app_res2b_branch2a_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res2b_branch2a"
	top: "app_res2b_branch2b"
	name: "app_res2b_branch2b"
	type: "Convolution"
	convolution_param {
		num_output: 64
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res2b_branch2b"
	top: "app_res2b_branch2b"
	name: "app_bn2b_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res2b_branch2b"
	top: "app_res2b_branch2b"
	name: "app_scale2b_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res2b_branch2b"
	top: "app_res2b_branch2b"
	name: "app_res2b_branch2b_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res2b_branch2b"
	top: "app_res2b_branch2c"
	name: "app_res2b_branch2c"
	type: "Convolution"
	convolution_param {
		num_output: 256
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res2b_branch2c"
	top: "app_res2b_branch2c"
	name: "app_bn2b_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res2b_branch2c"
	top: "app_res2b_branch2c"
	name: "app_scale2b_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res2a"
	bottom: "app_res2b_branch2c"
	top: "app_res2b"
	name: "app_res2b"
	type: "Eltwise"
}

layer {
	bottom: "app_res2b"
	top: "app_res2b"
	name: "app_res2b_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res2b"
	top: "app_res2c_branch2a"
	name: "app_res2c_branch2a"
	type: "Convolution"
	convolution_param {
		num_output: 64
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res2c_branch2a"
	top: "app_res2c_branch2a"
	name: "app_bn2c_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res2c_branch2a"
	top: "app_res2c_branch2a"
	name: "app_scale2c_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res2c_branch2a"
	top: "app_res2c_branch2a"
	name: "app_res2c_branch2a_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res2c_branch2a"
	top: "app_res2c_branch2b"
	name: "app_res2c_branch2b"
	type: "Convolution"
	convolution_param {
		num_output: 64
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res2c_branch2b"
	top: "app_res2c_branch2b"
	name: "app_bn2c_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res2c_branch2b"
	top: "app_res2c_branch2b"
	name: "app_scale2c_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res2c_branch2b"
	top: "app_res2c_branch2b"
	name: "app_res2c_branch2b_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res2c_branch2b"
	top: "app_res2c_branch2c"
	name: "app_res2c_branch2c"
	type: "Convolution"
	convolution_param {
		num_output: 256
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res2c_branch2c"
	top: "app_res2c_branch2c"
	name: "app_bn2c_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res2c_branch2c"
	top: "app_res2c_branch2c"
	name: "app_scale2c_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res2b"
	bottom: "app_res2c_branch2c"
	top: "app_res2c"
	name: "app_res2c"
	type: "Eltwise"
}

layer {
	bottom: "app_res2c"
	top: "app_res2c"
	name: "app_res2c_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res2c"
	top: "app_res3a_branch1"
	name: "app_res3a_branch1"
	type: "Convolution"
	convolution_param {
		num_output: 512
		kernel_size: 1
		pad: 0
		stride: 2
		bias_term: false
	}
}

layer {
	bottom: "app_res3a_branch1"
	top: "app_res3a_branch1"
	name: "app_bn3a_branch1"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res3a_branch1"
	top: "app_res3a_branch1"
	name: "app_scale3a_branch1"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res2c"
	top: "app_res3a_branch2a"
	name: "app_res3a_branch2a"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 1
		pad: 0
		stride: 2
		bias_term: false
	}
}

layer {
	bottom: "app_res3a_branch2a"
	top: "app_res3a_branch2a"
	name: "app_bn3a_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res3a_branch2a"
	top: "app_res3a_branch2a"
	name: "app_scale3a_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res3a_branch2a"
	top: "app_res3a_branch2a"
	name: "app_res3a_branch2a_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res3a_branch2a"
	top: "app_res3a_branch2b"
	name: "app_res3a_branch2b"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res3a_branch2b"
	top: "app_res3a_branch2b"
	name: "app_bn3a_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res3a_branch2b"
	top: "app_res3a_branch2b"
	name: "app_scale3a_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res3a_branch2b"
	top: "app_res3a_branch2b"
	name: "app_res3a_branch2b_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res3a_branch2b"
	top: "app_res3a_branch2c"
	name: "app_res3a_branch2c"
	type: "Convolution"
	convolution_param {
		num_output: 512
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res3a_branch2c"
	top: "app_res3a_branch2c"
	name: "app_bn3a_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res3a_branch2c"
	top: "app_res3a_branch2c"
	name: "app_scale3a_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res3a_branch1"
	bottom: "app_res3a_branch2c"
	top: "app_res3a"
	name: "app_res3a"
	type: "Eltwise"
}

layer {
	bottom: "app_res3a"
	top: "app_res3a"
	name: "app_res3a_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res3a"
	top: "app_res3b_branch2a"
	name: "app_res3b_branch2a"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res3b_branch2a"
	top: "app_res3b_branch2a"
	name: "app_bn3b_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res3b_branch2a"
	top: "app_res3b_branch2a"
	name: "app_scale3b_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res3b_branch2a"
	top: "app_res3b_branch2a"
	name: "app_res3b_branch2a_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res3b_branch2a"
	top: "app_res3b_branch2b"
	name: "app_res3b_branch2b"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res3b_branch2b"
	top: "app_res3b_branch2b"
	name: "app_bn3b_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res3b_branch2b"
	top: "app_res3b_branch2b"
	name: "app_scale3b_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res3b_branch2b"
	top: "app_res3b_branch2b"
	name: "app_res3b_branch2b_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res3b_branch2b"
	top: "app_res3b_branch2c"
	name: "app_res3b_branch2c"
	type: "Convolution"
	convolution_param {
		num_output: 512
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res3b_branch2c"
	top: "app_res3b_branch2c"
	name: "app_bn3b_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res3b_branch2c"
	top: "app_res3b_branch2c"
	name: "app_scale3b_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res3a"
	bottom: "app_res3b_branch2c"
	top: "app_res3b"
	name: "app_res3b"
	type: "Eltwise"
}

layer {
	bottom: "app_res3b"
	top: "app_res3b"
	name: "app_res3b_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res3b"
	top: "app_res3c_branch2a"
	name: "app_res3c_branch2a"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res3c_branch2a"
	top: "app_res3c_branch2a"
	name: "app_bn3c_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res3c_branch2a"
	top: "app_res3c_branch2a"
	name: "app_scale3c_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res3c_branch2a"
	top: "app_res3c_branch2a"
	name: "app_res3c_branch2a_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res3c_branch2a"
	top: "app_res3c_branch2b"
	name: "app_res3c_branch2b"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res3c_branch2b"
	top: "app_res3c_branch2b"
	name: "app_bn3c_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res3c_branch2b"
	top: "app_res3c_branch2b"
	name: "app_scale3c_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res3c_branch2b"
	top: "app_res3c_branch2b"
	name: "app_res3c_branch2b_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res3c_branch2b"
	top: "app_res3c_branch2c"
	name: "app_res3c_branch2c"
	type: "Convolution"
	convolution_param {
		num_output: 512
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res3c_branch2c"
	top: "app_res3c_branch2c"
	name: "app_bn3c_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res3c_branch2c"
	top: "app_res3c_branch2c"
	name: "app_scale3c_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res3b"
	bottom: "app_res3c_branch2c"
	top: "app_res3c"
	name: "app_res3c"
	type: "Eltwise"
}

layer {
	bottom: "app_res3c"
	top: "app_res3c"
	name: "app_res3c_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res3c"
	top: "app_res3d_branch2a"
	name: "app_res3d_branch2a"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res3d_branch2a"
	top: "app_res3d_branch2a"
	name: "app_bn3d_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res3d_branch2a"
	top: "app_res3d_branch2a"
	name: "app_scale3d_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res3d_branch2a"
	top: "app_res3d_branch2a"
	name: "app_res3d_branch2a_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res3d_branch2a"
	top: "app_res3d_branch2b"
	name: "app_res3d_branch2b"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res3d_branch2b"
	top: "app_res3d_branch2b"
	name: "app_bn3d_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res3d_branch2b"
	top: "app_res3d_branch2b"
	name: "app_scale3d_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res3d_branch2b"
	top: "app_res3d_branch2b"
	name: "app_res3d_branch2b_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res3d_branch2b"
	top: "app_res3d_branch2c"
	name: "app_res3d_branch2c"
	type: "Convolution"
	convolution_param {
		num_output: 512
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res3d_branch2c"
	top: "app_res3d_branch2c"
	name: "app_bn3d_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res3d_branch2c"
	top: "app_res3d_branch2c"
	name: "app_scale3d_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res3c"
	bottom: "app_res3d_branch2c"
	top: "app_res3d"
	name: "app_res3d"
	type: "Eltwise"
}

layer {
	bottom: "app_res3d"
	top: "app_res3d"
	name: "app_res3d_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res3d"
	top: "app_res4a_branch1"
	name: "app_res4a_branch1"
	type: "Convolution"
	convolution_param {
		num_output: 1024
		kernel_size: 1
		pad: 0
		stride: 2
		bias_term: false
	}
}

layer {
	bottom: "app_res4a_branch1"
	top: "app_res4a_branch1"
	name: "app_bn4a_branch1"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res4a_branch1"
	top: "app_res4a_branch1"
	name: "app_scale4a_branch1"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res3d"
	top: "app_res4a_branch2a"
	name: "app_res4a_branch2a"
	type: "Convolution"
	convolution_param {
		num_output: 256
		kernel_size: 1
		pad: 0
		stride: 2
		bias_term: false
	}
}

layer {
	bottom: "app_res4a_branch2a"
	top: "app_res4a_branch2a"
	name: "app_bn4a_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res4a_branch2a"
	top: "app_res4a_branch2a"
	name: "app_scale4a_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res4a_branch2a"
	top: "app_res4a_branch2a"
	name: "app_res4a_branch2a_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res4a_branch2a"
	top: "app_res4a_branch2b"
	name: "app_res4a_branch2b"
	type: "Convolution"
	convolution_param {
		num_output: 256
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res4a_branch2b"
	top: "app_res4a_branch2b"
	name: "app_bn4a_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res4a_branch2b"
	top: "app_res4a_branch2b"
	name: "app_scale4a_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res4a_branch2b"
	top: "app_res4a_branch2b"
	name: "app_res4a_branch2b_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res4a_branch2b"
	top: "app_res4a_branch2c"
	name: "app_res4a_branch2c"
	type: "Convolution"
	convolution_param {
		num_output: 1024
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res4a_branch2c"
	top: "app_res4a_branch2c"
	name: "app_bn4a_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res4a_branch2c"
	top: "app_res4a_branch2c"
	name: "app_scale4a_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res4a_branch1"
	bottom: "app_res4a_branch2c"
	top: "app_res4a"
	name: "app_res4a"
	type: "Eltwise"
}

layer {
	bottom: "app_res4a"
	top: "app_res4a"
	name: "app_res4a_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res4a"
	top: "app_res4b_branch2a"
	name: "app_res4b_branch2a"
	type: "Convolution"
	convolution_param {
		num_output: 256
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res4b_branch2a"
	top: "app_res4b_branch2a"
	name: "app_bn4b_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res4b_branch2a"
	top: "app_res4b_branch2a"
	name: "app_scale4b_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res4b_branch2a"
	top: "app_res4b_branch2a"
	name: "app_res4b_branch2a_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res4b_branch2a"
	top: "app_res4b_branch2b"
	name: "app_res4b_branch2b"
	type: "Convolution"
	convolution_param {
		num_output: 256
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res4b_branch2b"
	top: "app_res4b_branch2b"
	name: "app_bn4b_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res4b_branch2b"
	top: "app_res4b_branch2b"
	name: "app_scale4b_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res4b_branch2b"
	top: "app_res4b_branch2b"
	name: "app_res4b_branch2b_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res4b_branch2b"
	top: "app_res4b_branch2c"
	name: "app_res4b_branch2c"
	type: "Convolution"
	convolution_param {
		num_output: 1024
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res4b_branch2c"
	top: "app_res4b_branch2c"
	name: "app_bn4b_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res4b_branch2c"
	top: "app_res4b_branch2c"
	name: "app_scale4b_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res4a"
	bottom: "app_res4b_branch2c"
	top: "app_res4b"
	name: "app_res4b"
	type: "Eltwise"
}

layer {
	bottom: "app_res4b"
	top: "app_res4b"
	name: "app_res4b_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res4b"
	top: "app_res4c_branch2a"
	name: "app_res4c_branch2a"
	type: "Convolution"
	convolution_param {
		num_output: 256
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res4c_branch2a"
	top: "app_res4c_branch2a"
	name: "app_bn4c_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res4c_branch2a"
	top: "app_res4c_branch2a"
	name: "app_scale4c_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res4c_branch2a"
	top: "app_res4c_branch2a"
	name: "app_res4c_branch2a_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res4c_branch2a"
	top: "app_res4c_branch2b"
	name: "app_res4c_branch2b"
	type: "Convolution"
	convolution_param {
		num_output: 256
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res4c_branch2b"
	top: "app_res4c_branch2b"
	name: "app_bn4c_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res4c_branch2b"
	top: "app_res4c_branch2b"
	name: "app_scale4c_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res4c_branch2b"
	top: "app_res4c_branch2b"
	name: "app_res4c_branch2b_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res4c_branch2b"
	top: "app_res4c_branch2c"
	name: "app_res4c_branch2c"
	type: "Convolution"
	convolution_param {
		num_output: 1024
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res4c_branch2c"
	top: "app_res4c_branch2c"
	name: "app_bn4c_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res4c_branch2c"
	top: "app_res4c_branch2c"
	name: "app_scale4c_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res4b"
	bottom: "app_res4c_branch2c"
	top: "app_res4c"
	name: "app_res4c"
	type: "Eltwise"
}

layer {
	bottom: "app_res4c"
	top: "app_res4c"
	name: "app_res4c_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res4c"
	top: "app_res4d_branch2a"
	name: "app_res4d_branch2a"
	type: "Convolution"
	convolution_param {
		num_output: 256
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res4d_branch2a"
	top: "app_res4d_branch2a"
	name: "app_bn4d_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res4d_branch2a"
	top: "app_res4d_branch2a"
	name: "app_scale4d_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res4d_branch2a"
	top: "app_res4d_branch2a"
	name: "app_res4d_branch2a_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res4d_branch2a"
	top: "app_res4d_branch2b"
	name: "app_res4d_branch2b"
	type: "Convolution"
	convolution_param {
		num_output: 256
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res4d_branch2b"
	top: "app_res4d_branch2b"
	name: "app_bn4d_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res4d_branch2b"
	top: "app_res4d_branch2b"
	name: "app_scale4d_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res4d_branch2b"
	top: "app_res4d_branch2b"
	name: "app_res4d_branch2b_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res4d_branch2b"
	top: "app_res4d_branch2c"
	name: "app_res4d_branch2c"
	type: "Convolution"
	convolution_param {
		num_output: 1024
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res4d_branch2c"
	top: "app_res4d_branch2c"
	name: "app_bn4d_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res4d_branch2c"
	top: "app_res4d_branch2c"
	name: "app_scale4d_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res4c"
	bottom: "app_res4d_branch2c"
	top: "app_res4d"
	name: "app_res4d"
	type: "Eltwise"
}

layer {
	bottom: "app_res4d"
	top: "app_res4d"
	name: "app_res4d_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res4d"
	top: "app_res4e_branch2a"
	name: "app_res4e_branch2a"
	type: "Convolution"
	convolution_param {
		num_output: 256
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res4e_branch2a"
	top: "app_res4e_branch2a"
	name: "app_bn4e_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res4e_branch2a"
	top: "app_res4e_branch2a"
	name: "app_scale4e_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res4e_branch2a"
	top: "app_res4e_branch2a"
	name: "app_res4e_branch2a_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res4e_branch2a"
	top: "app_res4e_branch2b"
	name: "app_res4e_branch2b"
	type: "Convolution"
	convolution_param {
		num_output: 256
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res4e_branch2b"
	top: "app_res4e_branch2b"
	name: "app_bn4e_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res4e_branch2b"
	top: "app_res4e_branch2b"
	name: "app_scale4e_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res4e_branch2b"
	top: "app_res4e_branch2b"
	name: "app_res4e_branch2b_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res4e_branch2b"
	top: "app_res4e_branch2c"
	name: "app_res4e_branch2c"
	type: "Convolution"
	convolution_param {
		num_output: 1024
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res4e_branch2c"
	top: "app_res4e_branch2c"
	name: "app_bn4e_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res4e_branch2c"
	top: "app_res4e_branch2c"
	name: "app_scale4e_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res4d"
	bottom: "app_res4e_branch2c"
	top: "app_res4e"
	name: "app_res4e"
	type: "Eltwise"
}

layer {
	bottom: "app_res4e"
	top: "app_res4e"
	name: "app_res4e_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res4e"
	top: "app_res4f_branch2a"
	name: "app_res4f_branch2a"
	type: "Convolution"
	convolution_param {
		num_output: 256
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res4f_branch2a"
	top: "app_res4f_branch2a"
	name: "app_bn4f_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res4f_branch2a"
	top: "app_res4f_branch2a"
	name: "app_scale4f_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res4f_branch2a"
	top: "app_res4f_branch2a"
	name: "app_res4f_branch2a_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res4f_branch2a"
	top: "app_res4f_branch2b"
	name: "app_res4f_branch2b"
	type: "Convolution"
	convolution_param {
		num_output: 256
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res4f_branch2b"
	top: "app_res4f_branch2b"
	name: "app_bn4f_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res4f_branch2b"
	top: "app_res4f_branch2b"
	name: "app_scale4f_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res4f_branch2b"
	top: "app_res4f_branch2b"
	name: "app_res4f_branch2b_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res4f_branch2b"
	top: "app_res4f_branch2c"
	name: "app_res4f_branch2c"
	type: "Convolution"
	convolution_param {
		num_output: 1024
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res4f_branch2c"
	top: "app_res4f_branch2c"
	name: "app_bn4f_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res4f_branch2c"
	top: "app_res4f_branch2c"
	name: "app_scale4f_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res4e"
	bottom: "app_res4f_branch2c"
	top: "app_res4f"
	name: "app_res4f"
	type: "Eltwise"
}

layer {
	bottom: "app_res4f"
	top: "app_res4f"
	name: "app_res4f_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res4f"
	top: "app_res5a_branch1"
	name: "app_res5a_branch1"
	type: "Convolution"
	convolution_param {
		num_output: 2048
		kernel_size: 1
		pad: 0
		stride: 2
		bias_term: false
	}
}

layer {
	bottom: "app_res5a_branch1"
	top: "app_res5a_branch1"
	name: "app_bn5a_branch1"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res5a_branch1"
	top: "app_res5a_branch1"
	name: "app_scale5a_branch1"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res4f"
	top: "app_res5a_branch2a"
	name: "app_res5a_branch2a"
	type: "Convolution"
	convolution_param {
		num_output: 512
		kernel_size: 1
		pad: 0
		stride: 2
		bias_term: false
	}
}

layer {
	bottom: "app_res5a_branch2a"
	top: "app_res5a_branch2a"
	name: "app_bn5a_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res5a_branch2a"
	top: "app_res5a_branch2a"
	name: "app_scale5a_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res5a_branch2a"
	top: "app_res5a_branch2a"
	name: "app_res5a_branch2a_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res5a_branch2a"
	top: "app_res5a_branch2b"
	name: "app_res5a_branch2b"
	type: "Convolution"
	convolution_param {
		num_output: 512
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res5a_branch2b"
	top: "app_res5a_branch2b"
	name: "app_bn5a_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res5a_branch2b"
	top: "app_res5a_branch2b"
	name: "app_scale5a_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res5a_branch2b"
	top: "app_res5a_branch2b"
	name: "app_res5a_branch2b_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res5a_branch2b"
	top: "app_res5a_branch2c"
	name: "app_res5a_branch2c"
	type: "Convolution"
	convolution_param {
		num_output: 2048
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res5a_branch2c"
	top: "app_res5a_branch2c"
	name: "app_bn5a_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res5a_branch2c"
	top: "app_res5a_branch2c"
	name: "app_scale5a_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res5a_branch1"
	bottom: "app_res5a_branch2c"
	top: "app_res5a"
	name: "app_res5a"
	type: "Eltwise"
}

layer {
	bottom: "app_res5a"
	top: "app_res5a"
	name: "app_res5a_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res5a"
	top: "app_res5b_branch2a"
	name: "app_res5b_branch2a"
	type: "Convolution"
	convolution_param {
		num_output: 512
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res5b_branch2a"
	top: "app_res5b_branch2a"
	name: "app_bn5b_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res5b_branch2a"
	top: "app_res5b_branch2a"
	name: "app_scale5b_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res5b_branch2a"
	top: "app_res5b_branch2a"
	name: "app_res5b_branch2a_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res5b_branch2a"
	top: "app_res5b_branch2b"
	name: "app_res5b_branch2b"
	type: "Convolution"
	convolution_param {
		num_output: 512
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res5b_branch2b"
	top: "app_res5b_branch2b"
	name: "app_bn5b_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res5b_branch2b"
	top: "app_res5b_branch2b"
	name: "app_scale5b_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res5b_branch2b"
	top: "app_res5b_branch2b"
	name: "app_res5b_branch2b_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res5b_branch2b"
	top: "app_res5b_branch2c"
	name: "app_res5b_branch2c"
	type: "Convolution"
	convolution_param {
		num_output: 2048
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res5b_branch2c"
	top: "app_res5b_branch2c"
	name: "app_bn5b_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res5b_branch2c"
	top: "app_res5b_branch2c"
	name: "app_scale5b_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res5a"
	bottom: "app_res5b_branch2c"
	top: "app_res5b"
	name: "app_res5b"
	type: "Eltwise"
}

layer {
	bottom: "app_res5b"
	top: "app_res5b"
	name: "app_res5b_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res5b"
	top: "app_res5c_branch2a"
	name: "app_res5c_branch2a"
	type: "Convolution"
	convolution_param {
		num_output: 512
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res5c_branch2a"
	top: "app_res5c_branch2a"
	name: "app_bn5c_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res5c_branch2a"
	top: "app_res5c_branch2a"
	name: "app_scale5c_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res5c_branch2a"
	top: "app_res5c_branch2a"
	name: "app_res5c_branch2a_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res5c_branch2a"
	top: "app_res5c_branch2b"
	name: "app_res5c_branch2b"
	type: "Convolution"
	convolution_param {
		num_output: 512
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res5c_branch2b"
	top: "app_res5c_branch2b"
	name: "app_bn5c_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res5c_branch2b"
	top: "app_res5c_branch2b"
	name: "app_scale5c_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res5c_branch2b"
	top: "app_res5c_branch2b"
	name: "app_res5c_branch2b_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res5c_branch2b"
	top: "app_res5c_branch2c"
	name: "app_res5c_branch2c"
	type: "Convolution"
	convolution_param {
		num_output: 2048
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "app_res5c_branch2c"
	top: "app_res5c_branch2c"
	name: "app_bn5c_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "app_res5c_branch2c"
	top: "app_res5c_branch2c"
	name: "app_scale5c_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "app_res5b"
	bottom: "app_res5c_branch2c"
	top: "app_res5c"
	name: "app_res5c"
	type: "Eltwise"
}

layer {
	bottom: "app_res5c"
	top: "app_res5c"
	name: "app_res5c_relu"
	type: "ReLU"
}

layer {
	bottom: "app_res5c"
	top: "app_pool5"
	name: "app_pool5"
	type: "Pooling"
	pooling_param {
		kernel_size: 7
		stride: 1
		pool: AVE
	}
}
################################################################

####################################
layer {
	bottom: "data"
	top: "act_conv1"
	name: "act_conv1"
	type: "Convolution"
	convolution_param {
		num_output: 64
		kernel_size: 7
		pad: 3
		stride: 2
	}
}

layer {
	bottom: "act_conv1"
	top: "act_conv1"
	name: "act_bn_conv1"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "act_conv1"
	top: "act_conv1"
	name: "act_scale_conv1"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "act_conv1"
	top: "act_conv1"
	name: "act_conv1_relu"
	type: "ReLU"
}

layer {
	bottom: "act_conv1"
	top: "act_pool1"
	name: "act_pool1"
	type: "Pooling"
	pooling_param {
		kernel_size: 3
		stride: 2
		pool: MAX
	}
}

layer {
	bottom: "act_pool1"
	top: "act_res2a_branch1"
	name: "act_res2a_branch1"
	type: "Convolution"
	convolution_param {
		num_output: 256
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "act_res2a_branch1"
	top: "act_res2a_branch1"
	name: "act_bn2a_branch1"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "act_res2a_branch1"
	top: "act_res2a_branch1"
	name: "act_scale2a_branch1"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "act_pool1"
	top: "act_res2a_branch2a"
	name: "act_res2a_branch2a"
	type: "Convolution"
	convolution_param {
		num_output: 64
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "act_res2a_branch2a"
	top: "act_res2a_branch2a"
	name: "act_bn2a_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "act_res2a_branch2a"
	top: "act_res2a_branch2a"
	name: "act_scale2a_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "act_res2a_branch2a"
	top: "act_res2a_branch2a"
	name: "act_res2a_branch2a_relu"
	type: "ReLU"
}

layer {
	bottom: "act_res2a_branch2a"
	top: "act_res2a_branch2b"
	name: "act_res2a_branch2b"
	type: "Convolution"
	convolution_param {
		num_output: 64
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "act_res2a_branch2b"
	top: "act_res2a_branch2b"
	name: "act_bn2a_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "act_res2a_branch2b"
	top: "act_res2a_branch2b"
	name: "act_scale2a_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "act_res2a_branch2b"
	top: "act_res2a_branch2b"
	name: "act_res2a_branch2b_relu"
	type: "ReLU"
}

layer {
	bottom: "act_res2a_branch2b"
	top: "act_res2a_branch2c"
	name: "act_res2a_branch2c"
	type: "Convolution"
	convolution_param {
		num_output: 256
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "act_res2a_branch2c"
	top: "act_res2a_branch2c"
	name: "act_bn2a_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "act_res2a_branch2c"
	top: "act_res2a_branch2c"
	name: "act_scale2a_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "act_res2a_branch1"
	bottom: "act_res2a_branch2c"
	top: "act_res2a"
	name: "act_res2a"
	type: "Eltwise"
}

layer {
	bottom: "act_res2a"
	top: "act_res2a"
	name: "act_res2a_relu"
	type: "ReLU"
}

layer {
	bottom: "act_res2a"
	top: "act_res2b_branch2a"
	name: "act_res2b_branch2a"
	type: "Convolution"
	convolution_param {
		num_output: 64
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "act_res2b_branch2a"
	top: "act_res2b_branch2a"
	name: "act_bn2b_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "act_res2b_branch2a"
	top: "act_res2b_branch2a"
	name: "act_scale2b_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "act_res2b_branch2a"
	top: "act_res2b_branch2a"
	name: "act_res2b_branch2a_relu"
	type: "ReLU"
}

layer {
	bottom: "act_res2b_branch2a"
	top: "act_res2b_branch2b"
	name: "act_res2b_branch2b"
	type: "Convolution"
	convolution_param {
		num_output: 64
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "act_res2b_branch2b"
	top: "act_res2b_branch2b"
	name: "act_bn2b_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "act_res2b_branch2b"
	top: "act_res2b_branch2b"
	name: "act_scale2b_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "act_res2b_branch2b"
	top: "act_res2b_branch2b"
	name: "act_res2b_branch2b_relu"
	type: "ReLU"
}

layer {
	bottom: "act_res2b_branch2b"
	top: "act_res2b_branch2c"
	name: "act_res2b_branch2c"
	type: "Convolution"
	convolution_param {
		num_output: 256
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "act_res2b_branch2c"
	top: "act_res2b_branch2c"
	name: "act_bn2b_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "act_res2b_branch2c"
	top: "act_res2b_branch2c"
	name: "act_scale2b_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "act_res2a"
	bottom: "act_res2b_branch2c"
	top: "act_res2b"
	name: "act_res2b"
	type: "Eltwise"
}

layer {
	bottom: "act_res2b"
	top: "act_res2b"
	name: "act_res2b_relu"
	type: "ReLU"
}

layer {
	bottom: "act_res2b"
	top: "act_res2c_branch2a"
	name: "act_res2c_branch2a"
	type: "Convolution"
	convolution_param {
		num_output: 64
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "act_res2c_branch2a"
	top: "act_res2c_branch2a"
	name: "act_bn2c_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "act_res2c_branch2a"
	top: "act_res2c_branch2a"
	name: "act_scale2c_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "act_res2c_branch2a"
	top: "act_res2c_branch2a"
	name: "act_res2c_branch2a_relu"
	type: "ReLU"
}

layer {
	bottom: "act_res2c_branch2a"
	top: "act_res2c_branch2b"
	name: "act_res2c_branch2b"
	type: "Convolution"
	convolution_param {
		num_output: 64
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "act_res2c_branch2b"
	top: "act_res2c_branch2b"
	name: "act_bn2c_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "act_res2c_branch2b"
	top: "act_res2c_branch2b"
	name: "act_scale2c_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "act_res2c_branch2b"
	top: "act_res2c_branch2b"
	name: "act_res2c_branch2b_relu"
	type: "ReLU"
}

layer {
	bottom: "act_res2c_branch2b"
	top: "act_res2c_branch2c"
	name: "act_res2c_branch2c"
	type: "Convolution"
	convolution_param {
		num_output: 256
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "act_res2c_branch2c"
	top: "act_res2c_branch2c"
	name: "act_bn2c_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "act_res2c_branch2c"
	top: "act_res2c_branch2c"
	name: "act_scale2c_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "act_res2b"
	bottom: "act_res2c_branch2c"
	top: "act_res2c"
	name: "act_res2c"
	type: "Eltwise"
}

layer {
	bottom: "act_res2c"
	top: "act_res2c"
	name: "act_res2c_relu"
	type: "ReLU"
}

layer {
	bottom: "act_res2c"
	top: "act_res3a_branch1"
	name: "act_res3a_branch1"
	type: "Convolution"
	convolution_param {
		num_output: 512
		kernel_size: 1
		pad: 0
		stride: 2
		bias_term: false
	}
}

layer {
	bottom: "act_res3a_branch1"
	top: "act_res3a_branch1"
	name: "act_bn3a_branch1"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "act_res3a_branch1"
	top: "act_res3a_branch1"
	name: "act_scale3a_branch1"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "act_res2c"
	top: "act_res3a_branch2a"
	name: "act_res3a_branch2a"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 1
		pad: 0
		stride: 2
		bias_term: false
	}
}

layer {
	bottom: "act_res3a_branch2a"
	top: "act_res3a_branch2a"
	name: "act_bn3a_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "act_res3a_branch2a"
	top: "act_res3a_branch2a"
	name: "act_scale3a_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "act_res3a_branch2a"
	top: "act_res3a_branch2a"
	name: "act_res3a_branch2a_relu"
	type: "ReLU"
}

layer {
	bottom: "act_res3a_branch2a"
	top: "act_res3a_branch2b"
	name: "act_res3a_branch2b"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "act_res3a_branch2b"
	top: "act_res3a_branch2b"
	name: "act_bn3a_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "act_res3a_branch2b"
	top: "act_res3a_branch2b"
	name: "act_scale3a_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "act_res3a_branch2b"
	top: "act_res3a_branch2b"
	name: "act_res3a_branch2b_relu"
	type: "ReLU"
}

layer {
	bottom: "act_res3a_branch2b"
	top: "act_res3a_branch2c"
	name: "act_res3a_branch2c"
	type: "Convolution"
	convolution_param {
		num_output: 512
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "act_res3a_branch2c"
	top: "act_res3a_branch2c"
	name: "act_bn3a_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "act_res3a_branch2c"
	top: "act_res3a_branch2c"
	name: "act_scale3a_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "act_res3a_branch1"
	bottom: "act_res3a_branch2c"
	top: "act_res3a"
	name: "act_res3a"
	type: "Eltwise"
}

layer {
	bottom: "act_res3a"
	top: "act_res3a"
	name: "act_res3a_relu"
	type: "ReLU"
}

layer {
	bottom: "act_res3a"
	top: "act_res3b_branch2a"
	name: "act_res3b_branch2a"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "act_res3b_branch2a"
	top: "act_res3b_branch2a"
	name: "act_bn3b_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "act_res3b_branch2a"
	top: "act_res3b_branch2a"
	name: "act_scale3b_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "act_res3b_branch2a"
	top: "act_res3b_branch2a"
	name: "act_res3b_branch2a_relu"
	type: "ReLU"
}

layer {
	bottom: "act_res3b_branch2a"
	top: "act_res3b_branch2b"
	name: "act_res3b_branch2b"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "act_res3b_branch2b"
	top: "act_res3b_branch2b"
	name: "act_bn3b_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "act_res3b_branch2b"
	top: "act_res3b_branch2b"
	name: "act_scale3b_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "act_res3b_branch2b"
	top: "act_res3b_branch2b"
	name: "act_res3b_branch2b_relu"
	type: "ReLU"
}

layer {
	bottom: "act_res3b_branch2b"
	top: "act_res3b_branch2c"
	name: "act_res3b_branch2c"
	type: "Convolution"
	convolution_param {
		num_output: 512
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "act_res3b_branch2c"
	top: "act_res3b_branch2c"
	name: "act_bn3b_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "act_res3b_branch2c"
	top: "act_res3b_branch2c"
	name: "act_scale3b_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "act_res3a"
	bottom: "act_res3b_branch2c"
	top: "act_res3b"
	name: "act_res3b"
	type: "Eltwise"
}

layer {
	bottom: "act_res3b"
	top: "act_res3b"
	name: "act_res3b_relu"
	type: "ReLU"
}

layer {
	bottom: "act_res3b"
	top: "act_res3c_branch2a"
	name: "act_res3c_branch2a"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "act_res3c_branch2a"
	top: "act_res3c_branch2a"
	name: "act_bn3c_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "act_res3c_branch2a"
	top: "act_res3c_branch2a"
	name: "act_scale3c_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "act_res3c_branch2a"
	top: "act_res3c_branch2a"
	name: "act_res3c_branch2a_relu"
	type: "ReLU"
}

layer {
	bottom: "act_res3c_branch2a"
	top: "act_res3c_branch2b"
	name: "act_res3c_branch2b"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "act_res3c_branch2b"
	top: "act_res3c_branch2b"
	name: "act_bn3c_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "act_res3c_branch2b"
	top: "act_res3c_branch2b"
	name: "act_scale3c_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "act_res3c_branch2b"
	top: "act_res3c_branch2b"
	name: "act_res3c_branch2b_relu"
	type: "ReLU"
}

layer {
	bottom: "act_res3c_branch2b"
	top: "act_res3c_branch2c"
	name: "act_res3c_branch2c"
	type: "Convolution"
	convolution_param {
		num_output: 512
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "act_res3c_branch2c"
	top: "act_res3c_branch2c"
	name: "act_bn3c_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "act_res3c_branch2c"
	top: "act_res3c_branch2c"
	name: "act_scale3c_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "act_res3b"
	bottom: "act_res3c_branch2c"
	top: "act_res3c"
	name: "act_res3c"
	type: "Eltwise"
}

layer {
	bottom: "act_res3c"
	top: "act_res3c"
	name: "act_res3c_relu"
	type: "ReLU"
}

layer {
	bottom: "act_res3c"
	top: "act_res3d_branch2a"
	name: "act_res3d_branch2a"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "act_res3d_branch2a"
	top: "act_res3d_branch2a"
	name: "act_bn3d_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "act_res3d_branch2a"
	top: "act_res3d_branch2a"
	name: "act_scale3d_branch2a"
